Tekla Open API Reference for Tekla Structures 2025
TextAttributes Constructor
Overload List
Name | Description
Text.TextAttributes()
 Creates a new default text attributes instance that loads standard attributes.
Text.TextAttributes(String)
 Creates a new text attributes instance that loads the specified attributes.
Top
See Also
Reference
Text.TextAttributes Class
Tekla.Structures.Drawing Namespace